{"first_entity": "Bruce Willis", "second_entity": "Samuel L. Jackson", "movie": "Pulp Fiction", "text": "{first_entity} starred in Pulp Fiction, a 1994 American independent crime film written and directed by Quentin Tarantino from a story he conceived with Roger Avary. It tells four intertwining tales of crime and violence in Los Angeles, California. The film stars {second_entity}, John Travolta, Tim Roth, Ving Rhames, and Uma Thurman. The title refers to the pulp magazines and hardboiled crime novels popular during the mid-20th century, known for their graphic violence and punchy dialogue.\n\nTarantino wrote the film in 1992 and 1993, incorporating scenes that Avary originally wrote for True Romance (1993). Its plot occurs out of chronological order. The film is also self-referential from its opening moments, beginning with a title card that gives two dictionary definitions of 'pulp'. Considerable screen time is devoted to monologues and casual conversations with eclectic dialogue revealing each character's perspectives on several subjects, and the film features an ironic combination of humor and strong violence. TriStar Pictures reportedly turned down the script as 'too demented'. Miramax Films co-chairman Harvey Weinstein was enthralled, however, and the film became the first that Miramax Films fully financed.\n\nThe film won the Palme d'Or at the 1994 Cannes Film Festival and was a major critical and commercial success. It was nominated for seven awards at the 67th Academy Awards, including Best Picture, and won Best Original Screenplay; Travolta, {second_entity}, and Thurman were nominated for Best Actor, Best Supporting Actor, and Best Supporting Actress respectively. As a result of the film's success, Travolta's career was reinvigorated, and the previously unknown {second_entity} and Thurman became household names. The film's development, marketing, distribution, and profitability had a sweeping effect on independent cinema.\n\nThe film is widely regarded as Tarantino's magnum opus, with particular praise for its screenwriting. The self-reflexivity, unconventional structure, and extensive homage and pastiche have led critics to describe it as a touchstone of postmodern film. It is often considered a cultural watershed, influencing films and other media that adopted elements of its style. The cast was also widely praised, with Travolta, Thurman, and {second_entity} earning high acclaim. In 2008, Entertainment Weekly named it the best film since 1983, and it has appeared on many critics' lists of the greatest films ever made. In 2013, the film was selected for preservation in the United States National Film Registry by the Library of Congress as 'culturally, historically, or aesthetically significant'."}
{"first_entity": "Steve Martin", "second_entity": "Diane Keaton", "movie": "Father of the Bride", "text": "{first_entity} starred in Father of the Bride, a 1991 American romantic comedy film co-starring {second_entity}, Kimberly Williams (in her film debut), and Martin Short. It is a remake of the 1950 film of the same name. The story focuses on George Banks, a businessman who becomes flustered while he and his family prepare for his daughter's marriage.\n\nThe film opened to positive reviews and became a box office success. This was Nancy Meyers and {second_entity}'s second of four films together, the first being Baby Boom (1987); the others were an eponymous sequel and Something's Gotta Give (2003)."}
{"first_entity": "Leonardo DiCaprio", "second_entity": "Matt Damon", "movie": "The Departed", "text": "{first_entity} starred in The Departed, a 2006 American epic crime thriller film directed by Martin Scorsese and written by William Monahan. It is both a remake of the 2002 Hong Kong film Infernal Affairs and also loosely based on the real-life Boston Winter Hill Gang; the character Colin Sullivan is based on the corrupt FBI agent John Connolly, while the character Frank Costello is based on Irish-American gangster and crime boss Whitey Bulger. The film also stars {second_entity}, Jack Nicholson, and Mark Wahlberg, with Martin Sheen, Ray Winstone, Vera Farmiga, Alec Baldwin, Anthony Anderson, and James Badge Dale in supporting roles.\n\nThe film takes place in Boston and the surrounding metro area, primarily in the South Boston neighborhood. Irish Mob boss Frank Costello (Nicholson) plants Colin Sullivan ({second_entity}) as a spy within the Massachusetts State Police; simultaneously, the police assign undercover state trooper Billy Costigan to infiltrate Costello's mob crew. When both sides realize the situation, Sullivan and Costigan each attempt to discover the other's identity before they are found out.\n\nThe film was a critical and commercial success, grossing $291.5 million on a budget of around $90 million and receiving acclaim for its direction, performances (particularly of Nicholson and Wahlberg), screenplay, and editing. It won several accolades, including four Oscars at the 79th Academy Awards: for Best Picture, Best Director for Scorsese (his only personal Oscar win to date), Best Adapted Screenplay for Monahan, and Best Film Editing for editor Thelma Schoonmaker. The film also received six nominations each at the 64th Golden Globe Awards (winning one) and the 60th British Academy Film Awards, and two nominations at the 13th Screen Actors Guild Awards."}
{"first_entity": "Russell Crowe", "second_entity": "Jennifer Connelly", "movie": "A Beautiful Mind", "text": "{first_entity} starred in A Beautiful Mind, a 2001 American biographical drama film about the mathematician John Nash, a Nobel Laureate in Economics. The film is directed by Ron Howard based on a screenplay by Akiva Goldsman, who adapted the 1998 biography by Sylvia Nasar. The film's cast features Ed Harris, {second_entity}, Paul Bettany, Adam Goldberg, Judd Hirsch, Josh Lucas, Anthony Rapp, and Christopher Plummer in supporting roles. The story begins in Nash's days as a brilliant but asocial mathematics graduate student at Princeton University. After Nash accepts secretive work in cryptography, he becomes liable to a larger conspiracy, through which he begins to question his reality.\n\nThe film was released theatrically in the United States on December 21, 2001, by Universal Pictures and DreamWorks Pictures. It went on to gross over $313 million worldwide and won four Academy Awards, for Best Picture, Best Director, Best Adapted Screenplay, and Best Supporting Actress for {second_entity}. It was also nominated for Best Actor, Best Film Editing, Best Makeup, and Best Original Score."}
{"first_entity": "Ben Affleck", "second_entity": "Matt Damon", "movie": "Good Will Hunting", "text": "{first_entity} starred in Good Will Hunting, a 1997 American drama film directed by Gus Van Sant and written by and starring {second_entity}. It also stars Robin Williams, Stellan Skarsgård, and Minnie Driver. The film tells the story of janitor Will Hunting, whose mathematical genius is discovered by a professor at MIT.\n\nThe film received acclaim from critics and grossed over $225 million during its theatrical run against a $10 million budget. At the 70th Academy Awards, it received nominations in nine categories, including Best Picture and Best Director, and won in two: Best Supporting Actor for Williams and Best Original Screenplay. In 2014, it was ranked at number 53 in The Hollywood Reporter's '100 Favorite Films' list."}
{"first_entity": "Edward Norton", "second_entity": "Brad Pitt", "movie": "Fight Club", "text": "{first_entity} starred in Fight Club, a 1999 American film directed by David Fincher and also starring {second_entity} and Helena Bonham Carter. It is based on a 1996 novel by Chuck Palahniuk. There's an unnamed narrator, who is discontented with his white-collar job. He forms a 'fight club' with soap salesman Tyler Durden ({second_entity}) and becomes embroiled in a relationship with an impoverished but beguilingly attractive woman, Marla Singer (Bonham Carter).\n\nPalahniuk's novel was optioned by Fox 2000 Pictures producer Laura Ziskin, who hired Jim Uhls to write the film adaptation. Fincher was selected because of his enthusiasm for the story. He developed the script with Uhls and sought screenwriting advice from the cast and others in the film industry. It was filmed in and around Los Angeles from July to December 1998. He and the cast compared the film to Rebel Without a Cause (1955) and The Graduate (1967), with a theme of conflict between Generation X and the value system of advertising.\n\nStudio executives did not like the film and restructured Fincher's intended marketing campaign to try to reduce anticipated losses. Fight Club premiered at the 56th Venice International Film Festival on September 10, 1999, and was released in the United States on October 15, 1999 by 20th Century Fox. The film failed to meet the studio's expectations at the box office and received polarized reactions from critics. It was ranked as one of the most controversial and talked-about films of the 1990s. However, Fight Club later found commercial success with its home video release, establishing it as a cult classic and causing media to revisit the film. In 2009, on its tenth anniversary, The New York Times dubbed it the 'defining cult movie of our time.'"}
{"first_entity": "Al Pacino", "second_entity": "Robert De Niro", "movie": "Heat", "text": "{first_entity} starred in Heat, a 1995 American crime film written and directed by Michael Mann. It features an ensemble cast including {second_entity}, with Tom Sizemore, Jon Voight, and Val Kilmer in supporting roles. The film follows the conflict between an LAPD detective and a career thief, played by {second_entity}, while also depicting its effect on their professional relationships and personal lives.\n\nMann wrote the original script for Heat in 1979, basing it on Chicago police officer Chuck Adamson's pursuit of criminal Neil McCauley, after whom {second_entity}'s character is named. The script was first used for a television pilot developed by Mann, which became the 1989 television film L.A. Takedown after the pilot did not receive a series order. In 1994, Mann revisited the script to turn it into a feature film, co-producing the project with Art Linson. Due to the esteemed reputations of the co-stars, promotion centered on their involvement.\n\nHeat was released by Warner Bros. Pictures on December 15, 1995, to critical and commercial success. It grossed $187 million on a $60 million budget, while receiving positive reviews for Mann's direction and the actors' performances. The film is regarded as one of the most influential films of its genre and has inspired several other works. A sequel was announced to be in development on July 20, 2022."}
{"first_entity": "Keanu Reeves", "second_entity": "Laurence Fishburne", "movie": "The Matrix", "text": "{first_entity} starred in The Matrix, a 1999 science fiction action film written and directed by the Wachowskis. It is the first installment in the Matrix film series, starring {second_entity}, Carrie-Anne Moss, Hugo Weaving, and Joe Pantoliano, and depicts a dystopian future in which humanity is unknowingly trapped inside the Matrix, a simulated reality that intelligent machines have created to distract humans while using their bodies as an energy source. When computer programmer Thomas Anderson, under the hacker alias 'Neo', uncovers the truth, he joins a rebellion against the machines along with other people who have been freed from the Matrix.\n\nThe Matrix is an example of the cyberpunk subgenre of science fiction. The Wachowskis' approach to action scenes was influenced by anime and martial arts films (particularly fight choreographers and wire fu techniques from Hong Kong action cinema); other influences include Plato's cave and 1990s Telnet hacker communities. The film popularized terms such as the red pill, and introduced a visual effect known as 'bullet time', in which the heightened perception of certain characters is represented by allowing the action within a shot to progress in slow motion while the camera appears to move through the scene at normal speed.\n\nThe Matrix opened in theaters in the United States on March 31, 1999, to widespread acclaim from critics, who praised its innovative visual effects, action sequences, cinematography, and entertainment value. The film was a box office success, grossing over $460 million on a $63 million budget, becoming the highest-grossing Warner Bros. film of 1999 and the fourth-highest-grossing film of that year. The film received nominations at the 72nd Academy Awards for Best Visual Effects, Best Film Editing, Best Sound, and Best Sound Editing, winning all four categories. The film was also the recipient of numerous other accolades, including Best Sound and Best Special Visual Effects at the 53rd British Academy Film Awards, and the Wachowskis were awarded Best Director and Best Science Fiction Film at the 26th Saturn Awards. The Matrix is considered to be among the greatest science fiction films of all time, and in 2012, the film was selected for preservation in the United States National Film Registry by the Library of Congress for being 'culturally, historically, and aesthetically significant.'"}
{"first_entity": "Morgan Freeman", "second_entity": "Tim Robbins", "movie": "The Shawshank Redemption", "text": "{first_entity} starred in The Shawshank Redemption, a 1994 American prison drama film written and directed by Frank Darabont, based on the 1982 Stephen King novella Rita Hayworth and Shawshank Redemption. The film tells the story of banker Andy Dufresne ({second_entity}), who is sentenced to life in Shawshank State Penitentiary for the murders of his wife and her lover, despite his claims of innocence. Over the following two decades, he befriends a fellow prisoner, contraband smuggler Ellis 'Red' Redding, and becomes instrumental in a money laundering operation led by the prison warden Samuel Norton (Bob Gunton). William Sadler, Clancy Brown, Gil Bellows, and James Whitmore appear in supporting roles.\n\nDarabont purchased the film rights to King's story in 1987, but development did not begin until five years later, when he wrote the script over eight weeks. Two weeks after submitting his script to Castle Rock Entertainment, Darabont secured a $25 million budget to produce The Shawshank Redemption, which started pre-production in January 1993. While the film is set in Maine, principal photography took place from June to August 1993 almost entirely in Mansfield, Ohio, with the Ohio State Reformatory serving as the eponymous penitentiary.\n\nWhile The Shawshank Redemption received critical acclaim upon its release—particularly for its story, the performance of {second_entity}, Newman's score, Darabont's direction and screenplay and Roger Deakins' cinematography—the film was a box-office disappointment, earning only $16 million during its initial theatrical run. Many reasons were cited for its failure at the time, including competition from the films Pulp Fiction and Forrest Gump, the general unpopularity of prison films, its lack of female characters, and even the title, which was considered confusing for audiences. It went on to receive multiple award nominations, including seven Academy Award nominations, and a theatrical re-release that, combined with international takings, increased the film's box-office gross to $73.3 million."}
{"first_entity": "Christian Bale", "second_entity": "Heath Ledger", "movie": "The Dark Knight", "text": "{first_entity} starred in The Dark Knight, a 2008 superhero film directed by Christopher Nolan, from a screenplay co-written with his brother Jonathan. Based on the DC Comics superhero Batman, it is the sequel to Batman Begins (2005), and the second installment in The Dark Knight trilogy. The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos. The ensemble cast includes Michael Caine, {second_entity}, Gary Oldman, and Aaron Eckhart.\n\nThe Dark Knight was marketed with an innovative interactive viral campaign that initially focused on countering criticism of {second_entity}'s casting by those who believed he was a poor choice to portray the Joker. {second_entity} died from an accidental prescription drug overdose in January 2008, leading to widespread interest from the press and public regarding his performance. When it was released in July, The Dark Knight received acclaim for its mature tone and themes, visual style, and performances—particularly that of {second_entity}, who received many posthumous awards including Academy, BAFTA, and Golden Globe awards for Best Supporting Actor, making The Dark Knight the first comic-book film to receive major industry awards. It broke several box-office records and became the highest-grossing 2008 film, the fourth-highest-grossing film to that time, and the highest-grossing superhero film."}
{"first_entity": "Tom Cruise", "second_entity": "Val Kilmer", "movie": "Top Gun", "text": "{first_entity} starred in Top Gun, a 1986 American action drama film directed by Tony Scott and produced by Don Simpson and Jerry Bruckheimer, with distribution by Paramount Pictures. The screenplay was written by Jim Cash and Jack Epps Jr., and was inspired by an article titled 'Top Guns', written by Ehud Yonay and published in California magazine three years earlier. Lieutenant Pete 'Maverick' Mitchell is a young naval aviator aboard the aircraft carrier USS Enterprise. He and his radar intercept officer, Lieutenant (junior grade) Nick 'Goose' Bradshaw (Anthony Edwards), are given the chance to train at the United States Navy's Fighter Weapons School (Top Gun) at Naval Air Station Miramar in San Diego, California. Kelly McGillis, {second_entity}, and Tom Skerritt also appear in supporting roles.\n\nWhen Top Gun was released on May 16, 1986, although its visual effects and soundtrack were universally acclaimed, the film received mixed reviews from film critics. Despite this, four weeks after its release, the number of theaters showing it increased by 45 percent, and it overcame initial critical resistance to become a huge commercial hit, grossing $357 million globally against a production budget of $15 million. Top Gun was the highest-grossing domestic film of 1986, as well as the highest-grossing film of 1986 worldwide.\n\nThe film maintained its popularity over the years and earned an IMAX 3D re-release in 2013, while the retrospective critical reception became more positive. Additionally, the soundtrack to the film has since become one of the most popular movie soundtracks to date, reaching 9× Platinum certification. The film won both an Academy Award and a Golden Globe for 'Take My Breath Away' performed by Berlin.\n\nIn 2015, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it 'culturally, historically, or aesthetically significant'. A sequel, Top Gun: Maverick, in which Maverick and {second_entity} reprised their roles, was released 36 years later on May 27, 2022, and surpassed the original film both critically and commercially."}
{"first_entity": "Ryan Gosling", "second_entity": "Emma Stone", "movie": "La La Land", "text": "{first_entity} starred in La La Land, a 2016 American musical romantic comedy-drama film written and directed by Damien Chazelle. It stars {second_entity} as a struggling jazz pianist and an aspiring actress who meet and fall in love while pursuing their dreams in Los Angeles. The supporting cast includes John Legend, Rosemarie DeWitt, Finn Wittrock, and J. K. Simmons.\n\nHaving been fond of musicals during his time as a drummer, Chazelle first conceptualized the film alongside Justin Hurwitz while attending Harvard University together. After moving to Los Angeles in 2010, Chazelle penned the script but did not find a studio willing to finance the production without changes to his design. After the success of his film Whiplash (2014), the project was picked up by Summit Entertainment. Miles Teller and Emma Watson were originally in talks to star, but after both dropped out, {second_entity} was cast. Filming took place in Los Angeles between August and September 2015, with the film's score composed by Hurwitz, who also wrote the film's songs with lyricists Benj Pasek and Justin Paul and the dance choreography by Mandy Moore.\n\nLa La Land premiered at the 73rd Venice International Film Festival on August 31, 2016, and was released theatrically in the United States on December 9, by Lionsgate. The film emerged as a major commercial success, grossing $472 million worldwide on a budget of $30 million, and received widespread critical acclaim, particularly for Chazelle's direction and screenplay, the performance of {second_entity}, the score, musical numbers, cinematography, visual style, costumes, and production design. It went on to receive numerous accolades, including winning a record seven awards at the 74th Golden Globe Awards and received eleven nominations at the 70th British Academy Film Awards, winning five, including Best Film. The film also received a record-tying fourteen nominations at the 89th Academy Awards, winning in six categories including Best Director and Best Actress ({second_entity}). In the former category, Chazelle became the youngest winner at age 32. It has since been regarded as one of the best films of the 2010s and the 21st century, and as one of the best musical and romantic films of all time. A stage musical adaptation is in the works."}
{"first_entity": "Tom Hardy", "second_entity": "Charlize Theron", "movie": "Mad Max: Fury Road", "text": "{first_entity} starred in Mad Max: Fury Road, a 2015 Australian post-apocalyptic action film co-written, co-produced, and directed by George Miller. Miller collaborated with Brendan McCarthy and Nico Lathouris on the screenplay. The fourth installment in the Mad Max franchise, it was produced by Village Roadshow Pictures, RatPac-Dune Entertainment, and Kennedy Miller Mitchell, and distributed by Roadshow Entertainment in Australia and by Warner Bros. Pictures internationally. The film stars {second_entity}, with Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough, Zoë Kravitz, Abbey Lee, and Courtney Eaton in supporting roles. Set in a post-apocalyptic desert wasteland where petrol and water are scarce commodities, Fury Road follows Max Rockatansky ({first_entity}), who joins forces with Imperator Furiosa ({second_entity}) against warlord Immortan Joe (Keays-Byrne) and his army, leading to a lengthy road battle.\n\nMiller came up with the idea for Fury Road in 1987, but the film spent many years in development hell before pre-production began in 1998. Attempts to shoot the film in the 2000s were delayed numerous times due to the September 11 attacks, the Iraq War, and controversies surrounding star Mel Gibson, leading Miller to recast Gibson's role of Max Rockatansky. Miller decided to pursue the film again in 2007, after the release of his animated comedy film Happy Feet. In 2009, Miller announced that filming would begin in early 2011. Principal photography was delayed several more times before it actually began in July 2012. The film wrapped in December 2012, although additional footage was shot in November 2013.\n\nFury Road premiered in Los Angeles on 7 May 2015, and was released in Australia on 14 May. It grossed $380.4 million at the worldwide box office, making it the highest-grossing Mad Max film but incurring a net loss of $20–40 million with all expenses factored. The film was nominated for ten awards at the 88th Academy Awards, winning six, and received numerous other accolades, including Best Film from the National Board of Review, and was also named one of the top ten films of 2015 by the American Film Institute. Retrospectively, it has been called one of the greatest action films of all time and one of the best films of the 2010s."}
{"first_entity": "Mark Ruffalo", "second_entity": "Chris Evans", "movie": "The Avengers", "text": "{first_entity} starred in Marvel's The Avengers (titled Marvel Avengers Assemble in the United Kingdom and Ireland and commonly referred to as simply The Avengers), a 2012 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sixth film in the Marvel Cinematic Universe (MCU). Written and directed by Joss Whedon, the film features an ensemble cast including Robert Downey Jr., {second_entity}, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the Avengers, alongside Tom Hiddleston, Stellan Skarsgård, and Samuel L. Jackson. In the film, Nick Fury and the spy agency S.H.I.E.L.D. recruit Tony Stark, Steve Rogers ({second_entity}), Bruce Banner ({first_entity}), Thor, Natasha Romanoff, and Clint Barton to form a team capable of stopping Thor's brother Loki from subjugating Earth.\n\nThe film's development began when Marvel Studios received a loan from Merrill Lynch in April 2005. After the success of the film Iron Man in May 2008, Marvel announced that The Avengers would be released in July 2011 and would bring together Stark (Downey), Rogers ({second_entity}), Banner ({first_entity}), and Thor (Hemsworth) from Marvel's previous films. With the signing of Johansson as Romanoff in March 2009 and Renner as Barton in June 2010, the film was pushed back for a 2012 release. Whedon was brought on board in April 2010 and rewrote the original screenplay by Zak Penn. Production began in April 2011 in Albuquerque, New Mexico, before moving to Cleveland, Ohio in August and New York City in September. The film has more than 2,200 visual effects shots.\n\nThe Avengers premiered at the El Capitan Theatre in Los Angeles on April 11, 2012, and was released in the United States on May 4, as the final film in Phase One of the MCU. The film received praise for Whedon's direction and screenplay, visual effects, action sequences, acting, and musical score. It grossed over $1.5 billion worldwide, setting numerous box office records and becoming the third-highest-grossing film of all time at the time of its release and the highest-grossing film of 2012. It was the first Marvel production to generate $1 billion in ticket sales. In 2017, The Avengers was featured as one of the 100 greatest films of all time in an Empire magazine poll. It received a nomination for Best Visual Effects at the 85th Academy Awards, among numerous other accolades. Three sequels have been released: Avengers: Age of Ultron (2015), Avengers: Infinity War (2018), and Avengers: Endgame (2019)."}
{"first_entity": "Natalie Portman", "second_entity": "Mila Kunis", "movie": "Black Swan", "text": "{first_entity} starred in Black Swan, a 2010 American psychological horror film directed by Darren Aronofsky from a screenplay by Mark Heyman, John McLaughlin, and Andres Heinz, based on a story by Heinz. The film stars Vincent Cassel, {second_entity}, Barbara Hershey, and Winona Ryder in supporting roles. The plot revolves around a production of Tchaikovsky's Swan Lake by the company of New York City Ballet. The production requires a ballerina to play the innocent and fragile White Swan, for which the committed dancer Nina Sayers ({first_entity}) is a perfect fit, as well as the dark and sensual Black Swan, which are qualities better embodied by the new rival Lily ({second_entity}). Nina is overwhelmed by a feeling of immense pressure when she finds herself competing for the role, causing her to lose her tenuous grip on reality and descend into madness.\n\nAronofsky conceived the premise by connecting his viewings of a production of Swan Lake with an unrealized screenplay about understudies and the notion of being haunted by a double, similar to the folklore surrounding doppelgängers. Aronofsky cites Fyodor Dostoevsky's The Double as another inspiration for the film. The director also considered Black Swan a companion piece to his film The Wrestler (2008), with both films revolving around demanding performances for different kinds of art. He first discussed the project with the stars in 2000, and after a brief attachment to Universal Pictures, Black Swan was produced in New York City in 2009 by Fox Searchlight Pictures. {second_entity} trained in ballet for several months prior to filming.\n\nBlack Swan premiered at the 67th Venice International Film Festival on September 1, 2010, and had a limited release in the United States starting on December 3, before opening in wide release on December 17. Upon release, the film received positive reviews from critics, with praise toward Aronofsky's direction and the performances of {first_entity} and {second_entity}. It also emerged as a major commercial success at the box-office, grossing $329 million worldwide on a $13 million budget. The film received five nominations at the 83rd Academy Awards, including Best Picture and Best Director (Aronofsky); it also received four nominations at the 68th Golden Globe Awards, including Best Motion Picture – Drama and Best Director (Aronofsky)."}
{"first_entity": "Jake Gyllenhaal", "second_entity": "Jena Malone", "movie": "Donnie Darko", "text": "{first_entity} starred in Donnie Darko, a 2001 American science fiction psychological thriller film written and directed by Richard Kelly, and produced by Flower Films. It stars {second_entity}, Drew Barrymore, Mary McDonnell, Katharine Ross, Patrick Swayze, and Noah Wyle. Set in October 1988, the film follows Donnie Darko, an emotionally troubled teenager who inadvertently escapes a bizarre accident by sleepwalking. He has visions of Frank, a mysterious figure in a rabbit costume who informs him that the world will end in 28 days, 6 hours, 42 minutes, and 12 seconds.\n\nDevelopment began in late 1997 when Kelly had graduated from film school and started writing scripts. He took an early idea of a jet engine falling onto a house with no one knowing its origin and built the story around it. Kelly insisted on directing the film himself and struggled to secure backing from producers until 2000, when Pandora Cinema and Barrymore's Flower Films agreed to produce it on a $4.5 million budget. Filming took 28 days in the summer of 2000, mostly in California. The soundtrack features a cover of 'Mad World' by Tears for Fears by American musicians Gary Jules and Michael Andrews, which went to No. 1 on the UK Singles Chart for three weeks.\n\nDonnie Darko premiered at the Sundance Film Festival on January 19, 2001, followed by a limited theatrical release on October 26. Because the film's advertising featured a crashing plane and the September 11 attacks had occurred a month and a half before, it was scarcely advertised. This affected its box office performance, and it grossed just $517,375 in its initial run. However, the film gained a cult following, and after reissues, it went on to gross $7.5 million worldwide and earned more than $10 million in US home video sales. It was listed No. 2 in Empire's '50 Greatest Independent Films of All Time' and No. 53 in Empire's '500 Greatest Movies of All Time'. Kelly released Donnie Darko: The Director's Cut in 2004. The film was adapted into a stage production in 2007, and a sequel, S. Darko, followed in 2009 without Kelly's involvement. In 2021, he announced that work on a new sequel is in progress."}
{"first_entity": "Eddie Murphy", "second_entity": "Arsenio Hall", "movie": "Coming to America", "text": "{first_entity} starred in Coming to America, a 1988 American romantic comedy film directed by John Landis and based on a story originally created by the lead actor. The film also co-stars {second_entity}, James Earl Jones, John Amos, Madge Sinclair, and Shari Headley. The film was released in the United States on June 29, 1988. The story centers on Akeem Joffer, the crown prince of the fictional African nation of Zamunda, who travels to the United States in the hopes of finding a woman he can marry and who will love him for who he is, not for his status or for having been trained to please him.\n\nIn 1989, a pilot for a planned spin-off television series was made, although this was never picked up for a series. A sequel, Coming 2 America, was released on March 4, 2021."}
{"first_entity": "Sam Worthington", "second_entity": "Zoe Saldana", "movie": "Avatar", "text": "{first_entity} starred in Avatar, a 2009 epic science fiction film co-produced, co-edited, written, and directed by James Cameron. The cast includes {second_entity}, Stephen Lang, Michelle Rodriguez, and Sigourney Weaver. It is the first installment in the Avatar film series. It is set in the mid-22nd century, when humans are colonizing Pandora, a lush habitable moon of a gas giant in the Alpha Centauri star system, in order to mine the valuable mineral unobtanium. The expansion of the mining colony threatens the continued existence of a local tribe of Na'vi, a humanoid species indigenous to Pandora. The title of the film refers to a genetically engineered Na'vi body operated from the brain of a remotely located human that is used to interact with the natives of Pandora.\n\nDevelopment of Avatar began in 1994, when James Cameron wrote an 80-page treatment for the film. Filming was supposed to take place after the completion of Cameron's 1997 film Titanic, for a planned release in 1999; however, according to Cameron, the necessary technology was not yet available to achieve his vision of the film. Work on the language of the Na'vi began in 2005, and Cameron began developing the screenplay and fictional universe in early 2006. Avatar was officially budgeted at $237 million due to the groundbreaking array of new visual effects Cameron achieved in cooperation with Weta Digital in Wellington. Other estimates put the cost at between $280 million and $310 million for production and at $150 million for promotion. The film made extensive use of new motion capture filming techniques and was released for traditional viewing, 3D viewing, and 4D experiences (in selected South Korean theaters).\n\nAvatar premiered at the Odeon Leicester Square in London on December 10, 2009, and was released in the United States on December 18. The film received positive reviews from critics, who highly praised its groundbreaking visual effects, though the story received some criticism for being derivative. During its theatrical run, the film broke several box office records, including becoming the highest-grossing film of all time. In July 2019, this position was overtaken by Avengers: Endgame, but with subsequent re-releases, beginning with China in March 2021, it returned to becoming the highest-grossing film since then. Adjusted for inflation, Avatar is the second-highest-grossing movie of all time, only behind Gone with the Wind, with a total of a little more than $3.5 billion. It also became the first film to gross more than $2 billion and the best-selling video title of 2010 in the United States. Avatar was nominated for nine awards at the 82nd Academy Awards, winning three, and received numerous other accolades. The success of the film also led to electronics manufacturers releasing 3D televisions and caused 3D films to increase in popularity. Its success led to the Avatar franchise, which includes several sequels."}
{"first_entity": "Bill Murray", "second_entity": "Scarlett Johansson", "movie": "Lost in Translation", "text": "{first_entity} starred in Lost in Translation, a 2003 romantic comedy-drama film written and directed by Sofia Coppola. The film follows Bob Harris, a fading American movie star who is having a midlife crisis when he travels to Tokyo to promote Suntory whisky. There, he befriends another estranged American named Charlotte ({second_entity}), a young woman and recent college graduate. Giovanni Ribisi, Anna Faris, and Fumihiro Hayashi are also featured. The film explores themes of alienation and disconnection against a backdrop of cultural displacement in Japan. It defies mainstream narrative conventions and is atypical in its depiction of romance.\n\nCoppola started writing the film after spending time in Tokyo and becoming fond of the city. She began forming a story about two characters experiencing a 'romantic melancholy' in the Park Hyatt Tokyo, where she stayed while promoting her first feature film, the 1999 drama The Virgin Suicides. Coppola envisioned {first_entity} playing the role of Bob Harris from the beginning and tried to recruit him for up to a year, relentlessly sending him telephone messages and letters. While {first_entity} eventually agreed to play the part, he did not sign a contract; Coppola spent a quarter of the film's $4 million budget without knowing if he would actually appear for shooting. When he finally arrived, Coppola described feelings of significant relief.\n\nLost in Translation premiered on August 29, 2003, at the Telluride Film Festival, and was distributed to American theatres on September 12, 2003, to major commercial success, grossing $118 million worldwide, and receiving critical acclaim, with praise for the performances of {first_entity} and {second_entity}, as well as the writing and direction of Coppola. At the 76th Academy Awards, Lost in Translation won Coppola Best Original Screenplay, and the film was also nominated for Best Picture and Best Director (Coppola). Other accolades won include three Golden Globe Awards and three British Academy Film Awards."}
{"first_entity": "Jamie Foxx", "second_entity": "Christoph Waltz", "movie": "Django Unchained", "text": "{first_entity} starred in Django Unchained, a 2012 American revisionist Western film written and directed by Quentin Tarantino, starring {second_entity}, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles.\n\nSet in the Antebellum South and Old West, it is a highly stylized, revisionist tribute to spaghetti Westerns. Its title refers particularly to the 1966 Italian film Django by Sergio Corbucci (that film's star, Franco Nero, has a cameo appearance in Tarantino's). The story follows a slave ({first_entity}) who trains under a German bounty hunter ({second_entity}) with the ultimate goal of reuniting with his wife.\n\nDevelopment of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company (TWC). Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before casting {first_entity}. Principal photography took place from November 2011 to March 2012 in California, Wyoming, and Louisiana.\n\nThe premiere of Django Unchained took place at the Ziegfeld Theatre in New York City on December 11, 2012, and was theatrically released on December 25, 2012, in the United States. It grossed $426 million worldwide against its budget of $100 million, becoming Tarantino's highest-grossing movie to date.\n\nThe film received acclaim from critics, mainly for {second_entity}'s performance and Tarantino's direction and screenplay. The film's extensive graphic violence and frequent use of racial slurs were controversial. The film received numerous awards and nominations, winning two out of five nominations at the 85th Academy Awards. {second_entity} won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes, and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA."}